---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsSupportTopsideSurfaceType
source: html/ec20378c-a6ea-339e-d442-cff669c7343e.htm
---
# Autodesk.Revit.DB.Architecture.StairsSupportTopsideSurfaceType

The style of the topside surface of the support.

## Syntax (C#)
```csharp
public enum StairsSupportTopsideSurfaceType
```